{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "port_delay",
    "1": "weather_event",
    "2": "supplier_failure",
    "3": "geopolitical",
    "4": "transport_strike",
    "5": "customs_delay",
    "6": "none"
  },
  "initializer_range": 0.02,
  "label2id": {
    "customs_delay": 5,
    "geopolitical": 3,
    "none": 6,
    "port_delay": 0,
    "supplier_failure": 2,
    "transport_strike": 4,
    "weather_event": 1
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.0.0",
  "use_cache": false,
  "vocab_size": 30522
}
